GoalApp/app/models/user.rb

  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "KcheFDduDtyzkMLVoHpwIQ"], ["updated_at", "2018-09-14 22:42:28.859827"], ["id", 2]]